tests/Fixtures/Saloon/Currencies/fetch-a-list-of-currencies.json

{
    "statusCode": 200,
    "headers": {
        "Date": "Thu, 18 Jun 2026 12:54:52 GMT",
        "Content-Type": "application\/json",
        "Content-Length": "253",
        "Connection": "keep-alive",
        "x-ratelimit-remaining-minute": "993",
        "ratelimit-limit": "1000",
        "ratelimit-remaining": "993",
        "ratelimit-reset": "8",
        "x-ratelimit-limit-minute": "1000",
        "x-total-count": "6",
        "x-limit": "2000",
        "x-offset": "0",
        "Cache-Control": "no-store",
        "pragma": "no-cache",
        "vary": "Origin",
        "access-control-allow-origin": "https:\/\/office.bexio.com",
        "via": "1.1 google",
        "cf-cache-status": "DYNAMIC",
        "Server": "cloudflare",
        "CF-RAY": "a0da71f19cf1739d-ZRH"
    },
    "data": "[{\"id\":1,\"name\":\"CHF\",\"round_factor\":0.05},{\"id\":2,\"name\":\"EUR\",\"round_factor\":0.01},{\"id\":3,\"name\":\"USD\",\"round_factor\":0.01},{\"id\":4,\"name\":\"GBP\",\"round_factor\":0.01},{\"id\":5,\"name\":\"BRL\",\"round_factor\":0.01},{\"id\":7,\"name\":\"CNY\",\"round_factor\":0.01}]",
    "context": []
}